In [50]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import ttest_ind
from scipy.stats import chi2_contingency

In [78]:
data=pd.read_csv('Sales_add.csv')

In [110]:
data.head()

,Month,Region,Manager,Sales_before_digital_add(in $),Sales_After_digital_add(in $)
0,Month-1,Region - A,Manager - A,132921,270390
1,Month-2,Region - A,Manager - C,149559,223334
2,Month-3,Region - B,Manager - A,146278,244243
3,Month-4,Region - B,Manager - B,152167,231808
4,Month-5,Region - C,Manager - B,159525,258402

In [80]:
data.describe()

       Sales_before_digital_add(in $)  Sales_After_digital_add(in $)
count                       22.000000                      22.000000
mean                    149239.954545                  231123.727273
std                      14844.042921                   25556.777061
min                     130263.000000                  187305.000000
25%                     138087.750000                  214960.750000
50%                     147444.000000                  229986.500000
75%                     157627.500000                  250909.000000
max                     178939.000000                  276279.000000

# Check whether there is any increase in sales afterstepping into digital marketing

In [87]:
non_digital=data[['Sales_before_digital_add(in $)']]

In [88]:
non_digital.head()

   Sales_before_digital_add(in $)
0                          132921
1                          149559
2                          146278
3                          152167
4                          159525

In [90]:
non_digital.describe()

       Sales_before_digital_add(in $)
count                       22.000000
mean                    149239.954545
std                      14844.042921
min                     130263.000000
25%                     138087.750000
50%                     147444.000000
75%                     157627.500000
max                     178939.000000

In [93]:
digital=data[['Sales_After_digital_add(in $)']]

In [94]:
digital.head()

   Sales_After_digital_add(in $)
0                         270390
1                         223334
2                         244243
3                         231808
4                         258402

In [95]:
digital.describe()

       Sales_After_digital_add(in $)
count                      22.000000
mean                   231123.727273
std                     25556.777061
min                    187305.000000
25%                    214960.750000
50%                    229986.500000
75%                    250909.000000
max                    276279.000000

Null Hypothesis H0:Average sales before digital marketing and average sale after digital marketing are same
Alternative Hypothesis H1:Average sale before digital marketing and average sale after digital marketing are not same

In [136]:
ttest, pval = ttest_ind(non_digital,digital,alternative="less")

print("t-test",'{0:.10f}'.format(ttest[0]))
print("p-value", '{0:.10f}'.format(pval[0]))

if pval <0.05:
      print("we reject null hypothesis")
else:
      print("we accept null hypothesis")

t-test -12.9950844511
p-value 0.0000000000
we reject null hypothesis

We can say some increase in the sales after stepping into digital marketting

#  check whether there is any dependency between thefeatures “Region” and “Manager”.

In [65]:
data2=data[['Region','Manager','Sales_before_digital_add(in $)','Sales_After_digital_add(in $)']]
data2['sales']=data2['Sales_before_digital_add(in $)']+data['Sales_After_digital_add(in $)']

In [66]:
data2.head()

,Region,Manager,Sales_before_digital_add(in $),Sales_After_digital_add(in $),sales
0,Region - A,Manager - A,132921,270390,403311
1,Region - A,Manager - C,149559,223334,372893
2,Region - B,Manager - A,146278,244243,390521
3,Region - B,Manager - B,152167,231808,383975
4,Region - C,Manager - B,159525,258402,417927

In [ ]:
H0:Two variables are independent
H1:Two variables are dependent

In [114]:
table=pd.crosstab(data2['Region'],data2['Manager'],values=data2['sales'],aggfunc=sum)

In [115]:
table

Manager     Manager - A  Manager - B  Manager - C
Region
Region - A      1624951      1123683      1121946
Region - B      1510751       383975       760034
Region - C       376799      1113131       352731

In [116]:
chi2,p,dof,expected=chi2_contingency(table)

In [118]:
print('chi square value',chi2)
print('p Value',p)
print('degere of freedom',dof)
print('expected cell count',expected)

chi square value 1140286.3053337836
p Value 0.0
degere of freedom 4
expected cell count [[1624691.02484333 1212233.78051939 1033655.19463729]
 [1114345.8461298   831448.96919109  708965.18467911]
 [ 773464.12902687  577106.25028953  492090.6206836 ]]

In [ ]:
P value<level of significance so we can reject null hypothesis
The variable Region and Manager are dependent